# Group By Concept In Pandas

In [26]:
import pandas as pd

In [27]:
df_students = pd.DataFrame({
    "roll_no":[4,5,1,2,1,1,3,4,5,2,2,3,3],
    "branch":["Civil","Civil","Mech","Mech","Computer","Civil","Mech","Mech","Mech","Computer","Civil","Civil","Computer"],
    "name":["Rohit Sharma","Pranjal Gupta","Ashutosh Pandey","Rohini Sable","Mayuri Desai","Rohit Raj","Shubham Pandey","Anjali Sharma", "Salman Khan","John Wick","Joseph Carl","Atadipa Sharma","Shivam Pandey"],
    "percentage":[95,98,65,48,88,93,50,41,32,96,99,89,88]
})

df_students

    roll_no    branch             name  percentage
0         4     Civil     Rohit Sharma          95
1         5     Civil    Pranjal Gupta          98
2         1      Mech  Ashutosh Pandey          65
3         2      Mech     Rohini Sable          48
4         1  Computer     Mayuri Desai          88
5         1     Civil        Rohit Raj          93
6         3      Mech   Shubham Pandey          50
7         4      Mech    Anjali Sharma          41
8         5      Mech      Salman Khan          32
9         2  Computer        John Wick          96
10        2     Civil      Joseph Carl          99
11        3     Civil   Atadipa Sharma          89
12        3  Computer    Shivam Pandey          88

In [28]:
df_students.branch.value_counts()

branch
Civil       5
Mech        5
Computer    3
Name: count, dtype: int64

In [29]:
df_students.describe()

         roll_no  percentage
count  13.000000   13.000000
mean    2.769231   75.538462
std     1.423250   24.595445
min     1.000000   32.000000
25%     2.000000   50.000000
50%     3.000000   88.000000
75%     4.000000   95.000000
max     5.000000   99.000000

In [30]:
df_mech = df_students[df_students["branch"]== "Mech"]

In [31]:
df_mech

   roll_no branch             name  percentage
2        1   Mech  Ashutosh Pandey          65
3        2   Mech     Rohini Sable          48
6        3   Mech   Shubham Pandey          50
7        4   Mech    Anjali Sharma          41
8        5   Mech      Salman Khan          32

In [32]:
# group by

df_group = df_students.groupby("branch")

In [33]:
df_group

In [34]:
df_group.get_group("Mech")

   roll_no branch             name  percentage
2        1   Mech  Ashutosh Pandey          65
3        2   Mech     Rohini Sable          48
6        3   Mech   Shubham Pandey          50
7        4   Mech    Anjali Sharma          41
8        5   Mech      Salman Khan          32

In [35]:
df_group.get_group("Computer")

    roll_no    branch           name  percentage
4         1  Computer   Mayuri Desai          88
9         2  Computer      John Wick          96
12        3  Computer  Shivam Pandey          88

In [36]:
# Display all groups in one go

for key, value in df_group:
    print("------------------------------------------------------")
    print(f"Branch = {key}")
    print(value)

------------------------------------------------------
Branch = Civil
    roll_no branch            name  percentage
0         4  Civil    Rohit Sharma          95
1         5  Civil   Pranjal Gupta          98
5         1  Civil       Rohit Raj          93
10        2  Civil     Joseph Carl          99
11        3  Civil  Atadipa Sharma          89
------------------------------------------------------
Branch = Computer
    roll_no    branch           name  percentage
4         1  Computer   Mayuri Desai          88
9         2  Computer      John Wick          96
12        3  Computer  Shivam Pandey          88
------------------------------------------------------
Branch = Mech
   roll_no branch             name  percentage
2        1   Mech  Ashutosh Pandey          65
3        2   Mech     Rohini Sable          48
6        3   Mech   Shubham Pandey          50
7        4   Mech    Anjali Sharma          41
8        5   Mech      Salman Khan          32

In [37]:
# Display all groups in one go

for key, value in df_group:
    print("------------------------------------------------------")
    print(f"Branch = {key}")
    print(value.reset_index())

------------------------------------------------------
Branch = Civil
   index  roll_no branch            name  percentage
0      0        4  Civil    Rohit Sharma          95
1      1        5  Civil   Pranjal Gupta          98
2      5        1  Civil       Rohit Raj          93
3     10        2  Civil     Joseph Carl          99
4     11        3  Civil  Atadipa Sharma          89
------------------------------------------------------
Branch = Computer
   index  roll_no    branch           name  percentage
0      4        1  Computer   Mayuri Desai          88
1      9        2  Computer      John Wick          96
2     12        3  Computer  Shivam Pandey          88
------------------------------------------------------
Branch = Mech
   index  roll_no branch             name  percentage
0      2        1   Mech  Ashutosh Pandey          65
1      3        2   Mech     Rohini Sable          48
2      6        3   Mech   Shubham Pandey          50
3      7        4   Mech    Anjali Sharma          41
4      8        5   Mech      Salman Khan          32

In [23]:
# Perform Basic Operations like min, max, average
for key, value in df_group:
    print("------------------------------------------------------")
    print(f"Branch = {key}")
    print(f"Maximum Percentage = {value.percentage.max()}")
    print(f"Minimum Percentage = {value.percentage.min()}")
    print(f"Average Percentage = {value.percentage.mean().round(2)}")

------------------------------------------------------
Branch = Civil
Maximum Percentage = 99
Minimum Percentage = 89
Average Percentage = 94.8
------------------------------------------------------
Branch = Computer
Maximum Percentage = 96
Minimum Percentage = 88
Average Percentage = 90.67
------------------------------------------------------
Branch = Mech
Maximum Percentage = 65
Minimum Percentage = 32
Average Percentage = 47.2

In [38]:
df_group.min()

          roll_no            name  percentage
branch
Civil           1  Atadipa Sharma          89
Computer        1       John Wick          88
Mech            1   Anjali Sharma          32

In [39]:
df_group.max()

          roll_no            name  percentage
branch
Civil           5    Rohit Sharma          99
Computer        3   Shivam Pandey          96
Mech            5  Shubham Pandey          65

In [41]:
df_group.describe()

         roll_no                                         percentage  \
           count mean       std  min  25%  50%  75%  max      count
branch
Civil        5.0  3.0  1.581139  1.0  2.0  3.0  4.0  5.0        5.0
Computer     3.0  2.0  1.000000  1.0  1.5  2.0  2.5  3.0        3.0
Mech         5.0  3.0  1.581139  1.0  2.0  3.0  4.0  5.0        5.0


               mean        std   min   25%   50%   75%   max
branch
Civil     94.800000   4.024922  89.0  93.0  95.0  98.0  99.0
Computer  90.666667   4.618802  88.0  88.0  88.0  92.0  96.0
Mech      47.200000  12.194261  32.0  41.0  48.0  50.0  65.0

In [42]:
df_group.size()

branch
Civil       5
Computer    3
Mech        5
dtype: int64